---
kind: other
id: Properties.T:Autodesk.Revit.DB.AssemblyMemberDifferentGeometry
source: html/1dd3d4a8-83fc-f136-0c43-cecb019a902d.htm
---
# AssemblyMemberDifferentGeometry Properties

Specifies whether the .NET object represents a valid Revit entity.